Tekla.Structures.Model.ModelObject
The ModelObject class is an abstract base class for all model objects, such as parts, bolts,
welds and reinforcements.
Remarks:
One way to find out the correct names of the report properties is to open the Template Editor.
With the Template Editor you can see the listing of all the properties that can be added to
report templates.
In the following example a connection to the Tekla Structures model has already been established and
next the values of some user-defined attributes (UDAs) are going to be found out.
The UDAs asked are the string value of CHECKED_BY, the double value of CHECKED_DATE,
and the integer value of OBJECT_LOCKED.
using Tekla.Structures.Model;
using System;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Model Model = new Model();
ModelObjectEnumerator ObjectEnum = Model.GetModelObjectSelector().GetAllObjects();
ObjectEnum.SelectInstances = false; // Set the "SelectInstances" to false to speed up the enquiry; possible because only report properties are asked.
string Result = "CHECKED BY, CHECKED DATE, OBJECT LOCKED \n";
while(ObjectEnum.MoveNext())
{
if(ObjectEnum.Current != null)
{
Beam BeamObject = ObjectEnum.Current as Beam;
if(BeamObject != null)
{
string CheckedBy = "";
double DateCheckedValue = 0.0;
int LockedStatus = -1;
DateTime DateChecked = new System.DateTime(1970, 1, 1);
BeamObject.GetUserProperty("CHECKED_BY", ref CheckedBy);
BeamObject.GetUserProperty("CHECKED_DATE", ref DateCheckedValue);
BeamObject.GetUserProperty("OBJECT_LOCKED", ref LockedStatus);
if(CheckedBy.Length > 0 || DateCheckedValue > 0.0 ||
LockedStatus != -1)
DateChecked = DateChecked.AddSeconds(DateCheckedValue);
Result += CheckedBy;
Result += ", ";
Result += DateChecked.ToString("dd.MM.yyyy");
if(LockedStatus == 1)
{
Result += ", Locked\n";
}
else
{
Result += ", Not locked\n";
}
}
}
}
MessageBox.Show(Result);
}
}

Tekla.Structures.Model.ModelObject.modificationTimeInfo
Caching field for Tekla.Structures.Model.ModelObject.ModificationTimeInfo.

Tekla.Structures.Model.ModelObject.ObjectLabel
Object label.

Tekla.Structures.Model.ModelObject.ModificationTime
Gets latest time of the object was modified or created.
Remarks: The returned time is time of history revision which the object belongs to. For Sharing it is WriteOut time,
for multiuser is save time. If history it not written then this method returns null.
Returns: The date, if it was possible to retrieve it, null otherwise.

Tekla.Structures.Model.ModelObject.IsUpToDate
Gets if the object does not have a modification which is not shared.
Returns: True if object was written out (for sharing) or saved (for multiuser) after last editing.

Tekla.Structures.Model.ModelObject.ModificationTimeInfo
Gets modification time and local modification for the object.
The info is retrieved from Core once during ModelObject instance lifetime, then cached.

Tekla.Structures.Model.ModelObject.Insert
Inserts the model object instance into the model database.
The inserted instance must be of real type.
Returns: True on success.

Tekla.Structures.Model.ModelObject.Select
Selects the model object instance from the model database.
Returns: True on success.

Tekla.Structures.Model.ModelObject.Modify
Modifies the model instance in the model database.
Returns: True on success.

Tekla.Structures.Model.ModelObject.Delete
Deletes the instance from the model database.
Returns: True on success.

Tekla.Structures.Model.ModelObject.GetChildren
Returns an enumerator of all the children model objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.ModelObject.GetFatherComponent
Returns the father component of the model object.
Returns: A base component on success, otherwise null.

Tekla.Structures.Model.ModelObject.GetHierarchicObjects
Returns an enumerator of all the connected hierarchic objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.ModelObject.GetAllUserProperties(System.Collections.Hashtable@)
Retrieves all properties for the model object in one hashtable.
Type for the returned value must be checked using type casting.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
namespace ExampleUserProperties
{
internal class Program
{
static void Main()
{
Beam Beam1 = new Beam(new Point(0, 0, 0), new Point(1000, 0, 0));
Beam1.Profile.ProfileString = "HEA300";
Beam1.Insert();
Beam1.SetUserProperty("PROJECT_COMMENT", "MyProjectComment");
Beam1.SetUserProperty("COMMENT", "MyComment");
Beam1.SetUserProperty("PROJECT_INT", 1);
Beam1.SetUserProperty("PROJECT_DOUBLE", 3.25);
Hashtable values = new Hashtable();
Beam1.GetAllUserProperties(ref values);
bool resultstring1 = typeof(string) == values["PROJECT_COMMENT"].GetType();
bool resultstring2 = typeof(string) == values["COMMENT"].GetType();
bool resultint = typeof(int) == values["PROJECT_INT"].GetType();
bool resultdouble = typeof(double) == values["PROJECT_DOUBLE"].GetType();
bool result1 = "MyProjectComment".Equals(values["PROJECT_COMMENT"]);
bool result2 = "MyComment".Equals(values["COMMENT"]);
bool result3 = 1 == (int)values["PROJECT_INT"];
bool result4 = 3.25 == (double)values["PROJECT_DOUBLE"];
bool result5 = 4 == values.Count;
foreach (DictionaryEntry de in values)
{
Console.WriteLine(de.Key + ": " + de.Value.ToString());
}
Console.ReadKey();
}
}
}
values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetIntegerUserProperties(System.Collections.Hashtable@)
Retrieves all integer properties for the model object.
values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetDoubleUserProperties(System.Collections.Hashtable@)
Retrieves all double properties for the model object.
values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetStringUserProperties(System.Collections.Hashtable@)
Retrieves all string properties for the model object.
values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetAllReportProperties(System.Collections.ArrayList,System.Collections.ArrayList,System.Collections.ArrayList,System.Collections.Hashtable@)
Retrieves all properties for the model object in one hashtable.
Type for the returned value must be checked using type casting.
In the following example a connection to the Tekla Structures model has already been established and
next the values of some report properties attributes are going to be found out for bolt groups in model.
using Tekla.Structures.Model;
using System;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
ArrayList sNames = new ArrayList();
sNames.Add("NAME");
sNames.Add("SCREW_NAME");
sNames.Add("SCREW_TYPE");
sNames.Add("TYPE");
sNames.Add("TYPE1");
sNames.Add("TYPE2");
sNames.Add("TYPE3");
sNames.Add("TYPE4");
sNames.Add("STANDARD");
sNames.Add("SHORT_NAME");
sNames.Add("MATERIAL");
sNames.Add("FINISH");
sNames.Add("GRADE");
ArrayList iNames = new ArrayList();
iNames.Add("DATE");
iNames.Add("FATHER_ID");
iNames.Add("GROUP_ID");
iNames.Add("HIERARCHY_LEVEL");
iNames.Add("MODEL_TOTAL");
ArrayList dNames = new ArrayList();
dNames.Add("EXTRA_LENGTH");
dNames.Add("FLANGE_THICKNESS");
dNames.Add("FLANGE_WIDTH");
dNames.Add("HEIGHT");
dNames.Add("LENGTH");
dNames.Add("PRIMARYWEIGHT");
dNames.Add("PROFILE_WEIGHT");
dNames.Add("ROUNDING_RADIUS");
dNames.Add("LENGTH");
dNames.Add("DIAMETER");
dNames.Add("WEIGHT");
dNames.Add("HEAD_DIAMETER");
dNames.Add("THICKNESS");
dNames.Add("WASHER.THICKNESS");
dNames.Add("WASHER.INNER_DIAMETER");
dNames.Add("WASHER.OUTER_DIAMETER");
dNames.Add("WASHER.THICKNESS1");
dNames.Add("WASHER.INNER_DIAMETER1");
dNames.Add("WASHER.OUTER_DIAMETER1");
dNames.Add("WASHER.THICKNESS2");
dNames.Add("WASHER.INNER_DIAMETER2");
dNames.Add("WASHER.OUTER_DIAMETER2");
dNames.Add("NUT.THICKNESS");
dNames.Add("NUT.INNER_DIAMETER");
dNames.Add("NUT.OUTER_DIAMETER");
dNames.Add("NUT.THICKNESS2");
dNames.Add("NUT.OUTER_DIAMETER2");
ModelObjectEnumerator.AutoFetch = true;
ModelObjectEnumerator myEnum = myModel.GetModelObjectSelector().GetAllObjectsWithType(new Type[] { typeof(BoltGroup) });
while (myEnum.MoveNext())
{
try
{
myObject = myEnum.Current as ModelObject;
if (myObject != null)
{
Hashtable sValues = new Hashtable(sNames.Count + dNames.Count + iNames.Count);
if (myObject.GetAllReportProperties(sNames, dNames, iNames, ref sValues))
{
foreach (DictionaryEntry value in sValues)
Console.WriteLine(value.Key.ToString() + " : " + value.Value.ToString());
}
}
}
catch { }
}
}
}
stringNames: An array list containing the names of the string properties.
doubleNames: An array list containing the names of the double properties.
integerNames: An array list containing the names of the integer properties.
values: The return value, a hash table list  that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetIntegerReportProperties(System.Collections.ArrayList,System.Collections.Hashtable@)
Retrieves multiple integer report properties for the model object. It is faster
to fetch multiple properties at once.
names: An array list containing the names of the properties.
values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetDoubleReportProperties(System.Collections.ArrayList,System.Collections.Hashtable@)
Retrieves multiple double report properties for the model object. It is faster
to fetch multiple properties at once.
names: An array list containing the names of the properties.
values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetStringReportProperties(System.Collections.ArrayList,System.Collections.Hashtable@)
Retrieves multiple string report properties for the model object. It is faster
to fetch multiple properties at once.
names: An array list containing the names of the properties.
values: The return value, a hash table that contains all the values that were retrieved successfully.
Returns: True if at least one single property was retrieved successfully.

Tekla.Structures.Model.ModelObject.GetUserProperty(System.String,System.String@)
Retrieves a string property for the model object.
name: The name of the property to be retrieved.
value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetReportProperty(System.String,System.String@)
Retrieves a string property of the report for the model object.
name: The name of the property to be retrieved.
value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetUserProperty(System.String,System.Double@)
Retrieves a double property for the model object.
name: The name of the property to be retrieved.
value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetReportProperty(System.String,System.Double@)
Retrieves a double property of the report for the model object.
name: The name of the property to be retrieved.
value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetUserProperty(System.String,System.Int32@)
Retrieves an integer property for the model object.
name: The name of the property to be retrieved.
value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetReportProperty(System.String,System.Int32@)
Retrieves an integer property of the report for the model object.
name: The name of the property to be retrieved.
value: The return value.
Returns: True if the value was returned successfully.

Tekla.Structures.Model.ModelObject.GetDynamicStringProperty(System.String,System.String@)
Gets a dynamic string property from the model object.
name: The name of the property to be set.
value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ModelObject.SetDynamicStringProperty(System.String,System.String)
Sets a dynamic string property for the model object.
name: The name of the property to be set.
value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ModelObject.SetUserProperty(System.String,System.String)
Sets a string property for the model object.
name: The name of the property to be set.
value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ModelObject.SetUserProperty(System.String,System.Double)
Sets a double property for the model object.
name: The name of the property to be set.
value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ModelObject.SetUserProperty(System.String,System.Int32)
Sets an integer property for the model object.
name: The name of the property to be set.
value: The new value for the property.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ModelObject.SetUserProperties(System.Collections.Generic.List{System.String},System.Collections.Generic.List{System.String},System.Collections.Generic.List{System.String},System.Collections.Generic.List{System.Double},System.Collections.Generic.List{System.String},System.Collections.Generic.List{System.Int32})
Sets multiple properties for the model object.
stringPropertyNames: The names of the string properties to be set.
stringValues: The new values for the string properties.
doublePropertyNames: The names of the double properties to be set.
doubleValues: The new values for the double properties.
intPropertyNames: The names of the int properties to be set.
intValues: The new values for the int properties.
Returns: True if the property was set successfully.

Tekla.Structures.Model.ModelObject.GetCoordinateSystem
Returns the coordinate system for the given model object.
Returns: The coordinate system for the given model object.

Tekla.Structures.Model.ModelObject.SetPhase(Tekla.Structures.Model.Phase)
Sets the phase of the model object.
phase: The new phase. A phase with this phase's number must exist in the database.
Returns: True on success.

Tekla.Structures.Model.ModelObject.GetPhase(Tekla.Structures.Model.Phase@)
Retrieves the phase of the model object (the phase number, the phase name,
the phase comment and whether the phase is the current one or not).
phase: The returned phase.
Returns: True on success.

Tekla.Structures.Model.ModelObject.SetLabel(System.String)
Sets a label for an object when a new instance is created, this method must be called before Insert.
The label is used in plug-ins for identifying the changed object in modification.
label: The label to set to the model object.
Returns: True on success.

Tekla.Structures.Model.ModelObject.SetCustomObjectType(System.String)
Sets a custom object type name for an existing object.
type: The custom obect type name to set to the model object.
Returns: True on success.

Tekla.Structures.Model.ModelObject.GetCustomObjectType
Gets custom object type name from an existing object.
Returns: Type name string, empty string if type is not set.

Tekla.Structures.Model.ModelObject.CompareTo(System.Object)
Compares Identifiers of model objects.
obj: The model object to be used in comparison.
Returns: 0 if object Identifiers are the same, 1 if given object Identifier is bigger, -1 otherwise.

Tekla.Structures.Model.ModelObject.Equals(Tekla.Structures.Model.ModelObject)
Check if Identifiers of model objects are same.
other: The model object to be used in comparison.
Returns: true if object Identifiers are the same, false otherwise,

Tekla.Structures.Model.ModelObject.DeleteInstance
Deletes the instance from the model.
Returns: True on success.